"""
6. Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный предмет и наличие лекционных,
практических и лабораторных занятий по этому предмету и их количество.
Важно, чтобы для каждого предмета не обязательно были все типы занятий.
Сформировать словарь, содержащий название предмета и общее количество занятий по нему.
Вывести словарь на экран.
Примеры строк файла:
Информатика: 100(л) 50(пр) 20(лаб).
Физика: 30(л) — 10(лаб)
Физкультура: — 30(пр) —

Пример словаря:
{“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}
"""


my_dict = {}
try:
    with open('task_6.txt', 'r', encoding='utf-8') as file_handler:
        for el in file_handler:
            new_list = el.split(' ')
            name = new_list[0].split(':')[0]
            my_dict[name] = sum([int(itm.split('(')[0]) for itm in new_list[1:] if itm.split('(')[0].isdigit()])
    print(my_dict)
except IOError:
    print("An IOError has occurred!")
