"""
1. Реализовать класс Matrix (матрица). Обеспечить перегрузку конструктора класса (метод __init__()), который должен
принимать данные (список списков) для формирования матрицы.
Подсказка: матрица — система некоторых математических величин, расположенных в виде прямоугольной схемы.
Примеры матриц вы найдете в методичке.
Следующий шаг — реализовать перегрузку метода __str__() для вывода матрицы в привычном виде.
Далее реализовать перегрузку метода __add__() для реализации операции сложения двух объектов класса Matrix (двух матриц)
Результатом сложения должна быть новая матрица.
Подсказка: сложение элементов матриц выполнять поэлементно — первый элемент первой строки первой матрицы складываем
с первым элементом первой строки второй матрицы и т.д.
"""


class Matrix:

    def __init__(self, param_1, param_2, param_3):
        self.param_1 = param_1
        self.param_2 = param_2
        self.param_3 = param_3

    def __add__(self, other):
        return Matrix([self.param_1[0] + other.param_1[0], self.param_1[1] + other.param_1[1]],
                       [self.param_2[0] + other.param_2[0], self.param_2[1] + other.param_2[1]],
                       [self.param_3[0] + other.param_3[0], self.param_3[1] + other.param_2[1]])

    def __str__(self):
        return f"Matrix \n{self.param_1[0]} {self.param_1[1]}  \n{self.param_2[0]} {self.param_2[1]} \n{self.param_3[0]} {self.param_3[1]}"


mc = Matrix([31, 22], [37, 43], [51, 86])
mc2 = Matrix([1, 2], [7, 3], [1, 6])
print(mc+mc2)
