"""
1. Создать класс TrafficLight (светофор) и определить у него один атрибут color (цвет) и метод running (запуск).
Атрибут реализовать как приватный. В рамках метода реализовать переключение светофора в режимы: красный, желтый,
зеленый. Продолжительность первого состояния (красный) составляет 7 секунд, второго (желтый) — 2 секунды, третьего
(зеленый) — на ваше усмотрение. Переключение между режимами должно осуществляться только в указанном порядке (красный,
 желтый, зеленый). Проверить работу примера, создав экземпляр и вызвав описанный метод.
Задачу можно усложнить, реализовав проверку порядка режимов, и при его нарушении выводить соответствующее сообщение и
завершать скрипт.
"""
import time


class TrafficLight:
    __color = 'КРАСНЫЙ'

    def running(self):
        print('Светофор включен')
        while True:
            print(self.__color)
            if self.__color == 'КРАСНЫЙ':
                self.__color = 'ЖЕЛТЫЙ'
                time.sleep(7)
            elif self.__color == 'ЖЕЛТЫЙ':
                self.__color = 'ЗЕЛЕНЫЙ'
                time.sleep(2)
            elif self.__color == 'ЗЕЛЕНЫЙ':
                self.__color = 'КРАСНЫЙ'
                time.sleep(10)


start = TrafficLight()

print(start.running())
